import {santokuAccount} from './accountData';
import {adminAccount} from './accountMaxData';
import {maxDb} from '../db';
import {format2Iso8601} from '../utils/format2Iso8601';

export const questionMaxData = () => {
  maxDb.question.create({
    questionId: '1',
    title:
      'React Nativeのテキストで、一定の文字数以降は…表示する方法がわかりません。例えば、test1234567890aaaabbbbccccddddeeeeffffggggといったテキストをtest1234567890aaaa…みたいな表示にしたいです。',
    content: `React Nativeのテキストで、一定の文字数以降は…表示する方法を探しています。

質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容質問内容
`,
    tags: ['50'],
    datetime: '2022-05-28T10:00:00Z',
    beginner: true,
    resolved: true,
    views: 2000,
    answers: 30,
    likes: 1000,
    comments: 30,
    lastUpdatedAt: '2022-08-30T10:00:00Z',
    ...adminAccount,
  });
  maxDb.question.create({
    questionId: '2',
    title: `React Nativeで以下のように改行したテキストを表示するにはどうしたら良いでしょうか？
aaaaa
bbbbb
ccccc
ddddd
`,
    content: `React Nativeでテキストを改行する方法を知りたい。`,
    tags: ['10'],
    datetime: '2022-06-30T10:00:00Z',
    beginner: false,
    resolved: false,
    views: 0,
    answers: 0,
    likes: 0,
    comments: 0,
    lastUpdatedAt: '2022-07-08T10:00:00Z',
    ...adminAccount,
  });
  const date = new Date(2022, 7, 1, 10, 0, 0);
  [...(Array(48) as unknown[])].forEach((_, index) => {
    date.setDate(date.getDate() + 1);
    const account = index % 2 ? adminAccount : santokuAccount;
    const beginner = !!(index % 3);
    const resolved = !!(index % 5);
    maxDb.question.create({
      questionId: String(index + 3),
      title: `React Nativeに関する質問${index + 1}`,
      content: `「React Nativeに関してわからないことがあります。」シリーズの第${index + 1}弾です。`,
      tags: [String(index + 2)],
      datetime: format2Iso8601(date),
      beginner,
      resolved,
      views: 1,
      answers: 0,
      likes: index,
      comments: 0,
      lastUpdatedAt: format2Iso8601(date),
      ...account,
    });
  });
};
